InformationRegisters/КафкаПозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>КафкаПозиции</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КафкаПозиции/Ext/ManagerModule.bsl
Функция ПолучитьПозицию(Тема, Раздел) Экспорт
	
	Отбор = Новый Структура("Тема, Раздел", Тема, Раздел);
	Возврат ПолучитьПоследнее(, Отбор).Позиция;	
	
КонецФункции

Процедура УстановитьПозицию(Тема, Раздел, Позиция) Экспорт
	
	ТекДата = ТекущаяДата();
			
	МЗ = СоздатьМенеджерЗаписи();
	МЗ.Период = Дата(Год(ТекДата), Месяц(ТекДата), День(ТекДата), Час(ТекДата), 0, 0);
	МЗ.Тема = Тема;
	МЗ.Раздел = Раздел;
	МЗ.Позиция = Позиция;
	МЗ.ДатаУстановки = ТекДата;
	МЗ.Записать();
		
КонецПроцедуры

Процедура УдалитьСтарые(Тема, Раздел) Экспорт
	
	// Оставляем только последние 100 записей
	ОставлятьЗаписей = 100;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Тема"  , Тема);
	Запрос.УстановитьПараметр("Раздел", Раздел);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Колво
	|ИЗ
	|	РегистрСведений.КафкаПозиции КАК КафкаПозиции
	|ГДЕ
	|	КафкаПозиции.Тема = &Тема
	|	И КафкаПозиции.Раздел = &Раздел";
	КолвоВсего = Запрос.Выполнить().Выгрузить()[0].Колво;
	
	УдалитьЗаписей = КолвоВсего - ОставлятьЗаписей;	
	Если УдалитьЗаписей <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ " + Формат(УдалитьЗаписей, "ЧН=0; ЧГ=") + "
	|	КафкаПозиции.Период КАК Период
	|ИЗ
	|	РегистрСведений.КафкаПозиции КАК КафкаПозиции
	|ГДЕ
	|	КафкаПозиции.Тема = &Тема
	|	И КафкаПозиции.Раздел = &Раздел
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МЗ = СоздатьМенеджерЗаписи();
		МЗ.Период = Выборка.Период;
		МЗ.Тема	  = Тема;
		МЗ.Раздел = Раздел;
		МЗ.Удалить();
	КонецЦикла;
			
КонецПроцедуры
